In [46]:
import pandas as pd

In [47]:
df = pd.read_csv('titanic.csv')

In [48]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [49]:
output = df['Survived']

In [50]:
input= df.drop(['Survived'],axis='columns')

In [51]:
output.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [52]:
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [53]:
from sklearn.preprocessing import LabelEncoder
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [56]:
le_sex= LabelEncoder()
input.head()

   Pclass     Sex   Age     Fare  sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [58]:
input['sex_n']=le_sex.fit_transform(input['Sex'])

In [60]:
input.head()

   Pclass     Sex   Age     Fare  sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [68]:
input.drop(['Sex'],axis='columns' ,inplace=True)

In [69]:
from sklearn import tree

In [70]:
tree= tree.DecisionTreeClassifier()

In [76]:
input['Age'] =input['Age'].fillna(input['Age'].mean())

In [77]:
tree.fit(input,output)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [78]:
tree.score(input,output)

0.9797979797979798